{"Фамилия":{"0":"Иванов"},"Имя":{"0":"Иван"},"Отчество":{"0":"Иванович"},"ДатаРождения":{"0":"20.09.1989"},"НомерСтандарта":{"0":"1095н"},"ДатаСтандарта":{"0":"20.12.2012"},"СсылкаНаСтандарт":{"0":"http:\/\/www.consultant.ru\/document\/cons_doc_LAW_145580\/"},"КритерииКачества":{"0":"1. Выполнен осмотр врачом-инфекционистом не позднее 1 часа от момента поступления в стационар. 2.Выполнен осмотр врачом-неврологом не позднее 24 часов от момента поступления в стационар (при наличии неврологических нарушений). 3.Выполнен общий (клинический) анализ крови развернутый. 4.Выполнена спинномозговая пункция и исследование спинномозговой жидкости (цитоз, белок, глюкоза, лактат, цитологическое исследование) не позднее 6 часов от момента установления диагноза (при нейроборрелиозе и при отсутствии медицинских противопоказаний) 5.Выполнена повторная спинномозговая пункция и повторное исследование спинномозговой жидкости (цитоз, белок, глюкоза, лактат, цитологическое исследование) (при нейроборрелиозе). 6.Выполнено определение антител к борелии Бургдорфера (Borrelia burgdorferi) в крови. 7.Выполнена рентгенография пораженного сустава и\/или ультразвуковое исследование пораженного сустава (при суставном синдроме).8. Проведена терапия антибактериальными лекарственными препаратами (при отсутствии медицинских противопоказаний). 9.Достигнута стойкая нормализация температуры тела на момент выписки из стационара. 10. Исчезновение эритемы на момент выписки из стационара. 11. Достигнута нормализация уровня лейкоцитов в периферической крови на момент выписки из стационара"},"КлиническиеРекомендации":{"0":"http:\/\/www.consultant.ru\/document\/cons_doc_LAW_324709\/"},"СтрокиНесоответсвия":{"0":[{"ИмяТаблицы":"ТаблицаЛечения","НомерСтроки":"1","ИмяСтолбца":"КодУслуги","ТекстОшибки":"Услуга не соответсвует стандарту № 1095н от 20.09.2012 г."},{"ИмяТаблицы":"ТаблицаЛекарств","НомерСтроки":"0","ИмяСтолбца":"Метоклопрамид","ТекстОшибки":"превышена дозировка"}]},"СтрокиДобавить":{"0":[{"ИмяТаблицы":"ТаблицаЛечения","КодУслуги":"B03.016.003","НаименованиеУслуги":"Общий (клинический) анализ крови развернутый","СредняяЧастота":"1","СредняяКратность":"2"},{"ИмяТаблицы":"ТаблицаЛекарств","Код":"N02BE","Классификация":"Анилиды","Наименование":"Парацетамол","СредняяЧастота":"1","ЕдиницаИзмерения":"мг","ССД":"500","СКД":"2500"}]}}